# Задача 2
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

#========================================================================

#Решение:

num = int(input("Введите трехзначное целое положительное число: "))
numMin = 100
numMax = 999

if numMin <= num <= numMax:
    num1 = num // 100
    num2 = num % 100 // 10
    num3 = num % 10
    sumNum = num1 + num2 + num3
    print("{} -> {} ({} + {} + {})".format(num, sumNum, num1, num2, num3))
elif num < numMin:
    print("Вы ввели слишком маленькое число")
elif num > numMax:
    print("Вы ввели слишком большое число")

#========================================================================